Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.SelectRebarItem Method (String, Double, Boolean)
 Selects a rebar item in the rebar database with the given grade and nominal diameter.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarItem SelectRebarItem(
	string Grade,
	double Diameter,
	bool UseNominalDiameter
)
Public Shared Function SelectRebarItem (
	Grade As String,
	Diameter As Double,
	UseNominalDiameter As Boolean
) As RebarItem
Parameters
Grade
Type: System.String
The grade of the rebar item to select.
Diameter
Type: System.Double
The diameter of the rebar item to select.
UseNominalDiameter
Type: System.Boolean
 If set to false, the item is selected based on the actual diameter. If true, the item is selected based on the nominal diameter.
Return Value
Type: RebarItem
The first RebarItem that matches the conditions.
See Also
Reference
RebarItemEnumerator Class
SelectRebarItem Overload
Tekla.Structures.Catalogs Namespace